---
kind: method
id: M:Autodesk.Revit.DB.Categories.ReverseIterator
source: html/65147b61-2771-bedf-a3b4-0a7e99292fa1.htm
---
# Autodesk.Revit.DB.Categories.ReverseIterator Method

Retrieves a backward moving iterator to the map.

## Syntax (C#)
```csharp
public override CategoryNameMapIterator ReverseIterator()
```

## Returns
A backward moving iterator to the map.